# Pandas

Lib muito utilizada para representaçãod e dados, filtragem e estatística.

## Fazendo a leitura de um arquivo

In [3]:
# Importando o Pandas
import pandas as pd

# Fazendo a leitura do arquivo do Excel
pd.read_excel('Dataset.xlsx', 'Planilha1')

  Python Data Analytics
0                 Numpy
1                Pandas
2            Matplotlib
3               Seaborn
4      Machine Learning

In [4]:
# Fazendo a leitura de um arquivo CSV
pd.read_csv('Quadrinhos.csv')

           Name        Publiser
0    Spider-Man   Marvel Comics
1     Super-Man       DC Comics
2      Iron-Man   Marvel Comics
3  Wonder Woman       DC Comics
4        Batman       DC Comics

In [5]:
# Fazendo a leitura de um arquivo TXT
pd.read_csv('quadrinhos.txt')

           Name        Publiser
0    Spider-Man   Marvel Comics
1     Super-Man       DC Comics
2      Iron-Man   Marvel Comics
3  Wonder Woman       DC Comics
4        Batman       DC Comics

## Criando um DataFrame

In [10]:
# Criando o conjunto de dados do DataFrame
dadosFrame = {
    'nome': ['Barry', 'Kara', 'Clark'],
    'idade': [28, 32, 52],
    'função': ['Fotografo', 'Secretaria', 'Reporter']
}

# Colocando as infos do dadosFrame dentro do df
df = pd.DataFrame(dadosFrame)

df # Imprimindo meu DataFrame
# Outra forma de apresentar na tela seria o print(df)

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter

In [11]:
# Pesquisando uma info dentro do df
df.loc[df['nome'] == 'Kara']

   nome  idade      função
1  Kara     32  Secretaria

In [15]:
# Outra forma de retornar uma informação
df.loc[2]

nome         Clark
idade           52
função    Reporter
Name: 2, dtype: object

In [22]:
# Terceira forma de fazer pesquisa
df[::-1]

    nome  idade      função
2  Clark     52    Reporter
1   Kara     32  Secretaria
0  Barry     28   Fotografo

In [34]:
# Criando o conjunto de dados com os números
frame_numeros = {
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}

# dfNum = dfNumeros
dfNum = pd.DataFrame(frame_numeros)

dfNum # Imprimindo meu DataFrame

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [35]:
import numpy as np # Importando o Numpy para trabalhar com números/operações

# Raiz quadrada de todos os elementos
dfNum.apply(np.sqrt)

          A         B         C
0  1.000000  2.000000  2.645751
1  1.414214  2.236068  2.828427
2  1.732051  2.449490  3.000000

In [33]:
# Somar todos os valores das minhas colunas
dfNum.apply(np.sum)

A     6
B    15
C    24
dtype: int64

In [36]:
# Aplicando a raiz quadrada apenas para a coluna B
dfNum['B'].apply(np.sqrt)

0    2.000000
1    2.236068
2    2.449490
Name: B, dtype: float64

### Reorganizando os valores

In [37]:
nums = {
    'A': [22,11,45],
    'B': [18,23,32],
    'C': [45,56,70],
    'D': [113,14,11]
}

dfNumDois = pd.DataFrame(nums)

dfNumDois

    A   B   C    D
0  22  18  45  113
1  11  23  56   14
2  45  32  70   11

In [51]:
dfNumDois.sort_values(by=['A'])

    A   B   C    D
1  11  23  56   14
0  22  18  45  113
2  45  32  70   11

## Removendo itens duplicados

In [54]:
dadosFrame = {
    'nome': ['Barry', 'Kara', 'Clark', 'Barry'],
    'idade': [28, 32, 52, 28],
    'função': ['Fotografo', 'Secretaria', 'Reporter', 'Fotografo']
}

df = pd.DataFrame(dadosFrame)
df # Imprimindo meu DataFrame

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter
3  Barry     28   Fotografo

In [56]:
# Serve para mostrar o que está duplicado
# Saberemos qual é a duplicata, pelo resultado = True
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [57]:
# Excluindo o dado duplicado
df.drop_duplicates()

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter

In [58]:
df

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter
3  Barry     28   Fotografo

In [60]:
# Consulta e exclusao por meio da coluna 'nome'
df.drop_duplicates(['nome'])

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter

In [62]:
# Apagando a coluna 'Função'
df.drop(['função'], axis=1) # axis = 1(Colunas) axis = 0(Linhas)

    nome  idade
0  Barry     28
1   Kara     32
2  Clark     52
3  Barry     28

In [63]:
df

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter
3  Barry     28   Fotografo

In [99]:
dadosFrame2 = {
    'nome': ['Barry', 'Kara', 'Clark', 'Barry','Clark', 'Barry'],
    'idade': [28, 32, 52, 29, 52, 29],
    'função': ['Fotografo', 'Secretaria', 'Reporter', 'Fotografo', 'Reporter', 'Fotografo']
}

df2 = pd.DataFrame(dadosFrame2)
df2 # Imprimindo meu DataFrame

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter
3  Barry     29   Fotografo
4  Clark     52    Reporter
5  Barry     29   Fotografo

In [100]:
df2.duplicated()
# Verifica se todos os elementos estão repetidos
# Nesse exemplo, ele verifica todos os dados e se há repetição

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [101]:
df2.drop_duplicates(['nome'], keep='first')
# Mantém o primeiro elemento que está duplicado

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter

In [102]:
df2.drop_duplicates(['nome'], keep='last')
# Mantém o último elemento que está duplicado

    nome  idade      função
1   Kara     32  Secretaria
4  Clark     52    Reporter
5  Barry     29   Fotografo

In [103]:
df2

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter
3  Barry     29   Fotografo
4  Clark     52    Reporter
5  Barry     29   Fotografo

In [104]:
df2.drop_duplicates(['nome'], keep=False)
# Mantém o elemento que não está duplicado

   nome  idade      função
1  Kara     32  Secretaria

In [106]:
df2.drop_duplicates(['nome'])

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter

In [107]:
df2.drop([0])

    nome  idade      função
1   Kara     32  Secretaria
2  Clark     52    Reporter
3  Barry     29   Fotografo
4  Clark     52    Reporter
5  Barry     29   Fotografo

In [108]:
df2.drop([3])

    nome  idade      função
0  Barry     28   Fotografo
1   Kara     32  Secretaria
2  Clark     52    Reporter
4  Clark     52    Reporter
5  Barry     29   Fotografo

In [110]:
dadosFrame = {
    'nome': ['Barry', 'Kara', 'Clark'],
    'idade': [28, 32, 52],
    'função': ['Fotografo', 'Secretaria', 'Reporter']
}

df3 = pd.DataFrame(dadosFrame, index = ['Flash', 'SuperGirl', 'SuperMan'])
df3 # Imprimindo meu DataFrame

            nome  idade      função
Flash      Barry     28   Fotografo
SuperGirl   Kara     32  Secretaria
SuperMan   Clark     52    Reporter

In [112]:
df3.drop(['Flash'])

            nome  idade      função
SuperGirl   Kara     32  Secretaria
SuperMan   Clark     52    Reporter

In [113]:
df3

            nome  idade      função
Flash      Barry     28   Fotografo
SuperGirl   Kara     32  Secretaria
SuperMan   Clark     52    Reporter

In [115]:
df3['nome'].count()

3

In [116]:
df3['idade'].count()

3

In [117]:
df3['função'].count()

3

In [118]:
df3.count()

nome      3
idade     3
função    3
dtype: int64

In [119]:
df3[1:2]

           nome  idade      função
SuperGirl  Kara     32  Secretaria

In [122]:
df3[-1:] # Mostrando apenas a última linha

           nome  idade    função
SuperMan  Clark     52  Reporter

In [123]:
df3[:-1] # Mostrando o df3 sem a última linha

            nome  idade      função
Flash      Barry     28   Fotografo
SuperGirl   Kara     32  Secretaria